The  FileImportingEventArgs  type exposes the following members.
 Properties
Name  |   Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from  RevitAPIEventArgs  .)
Document
 The document associated with the event.
 (Inherited from  RevitAPIPreDocEventArgs  .)
Format
 Identifies the import format, e.g. DWG or image.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  RevitAPIEventArgs  .)
Path
 Path of the source file which is about to be imported.
 See Also
  FileImportingEventArgs Class
  Autodesk.Revit.DB.Events Namespace